
![[Pasted image 20240302112137.png]]

Настройка коммутатора L3 для создания 3 сегментов VLAN и осуществление сообщения между этими сегментами
```cisco
Switch>en //войти в привелегированный режим
Switch#conf t //режим глобальной конфигурации
Enter configuration commands, one per line.  End with CNTL/Z.

Switch(config)#vlan 2 //создать сегмент vlan с id 2
Switch(config-vlan)#name VLAN2 //дать имя этому сегменту VLAN2
Switch(config-vlan)#exit //выйти из настройки сегмента VLAN2
// дальше по аналогии создаются еще 2 сегмента 
Switch(config)#vlan 3
Switch(config-vlan)#name VLAN3
Switch(config-vlan)#exit
Switch(config)#vlan 4
Switch(config-vlan)#name VLAN4
Switch(config-vlan)#exit
Switch(config)#

Switch(config)#int fa0/1 //перейти к настройке интерфейса fastEthernet0/1
Switch(config-if)#switchport mode access //переключить его режим на access
Switch(config-if)#switchport access vlan 2 //закрепить его за сегментом VLAN2
Switch(config-if)#exit //выйти из настройки fastEthernet0/1
//дальше по аналогии настраиваем еще 2 интерфейса fastEthernet
Switch(config)#int fa0/2
Switch(config-if)#switchport mode access 
Switch(config-if)#switchport access vlan 3
Switch(config-if)#exit
Switch(config)#int fa0/3
Switch(config-if)#switchport mode access 
Switch(config-if)#switchport access vlan 3
Switch(config-if)#exit

//Так как это коммутатор L3 то нужно настроить IP для vlan interface
Switch(config)#int vlan 2 //перейти к настройке интерфейса VLAN2
Switch(config-if)#
%LINK-5-CHANGED: Interface Vlan2, changed state to up
%LINEPROTO-5-UPDOWN: Line protocol on Interface Vlan2, changed state to up
Switch(config-if)#ip address 2.2.2.1 255.255.255.0 //установить IP address
Switch(config-if)#exit //выйти из настройки интерфейса VLAN2
//дальше по аналогии настраиваем вируальные интерфейсы VLAN3, VLAN4
Switch(config)#int vlan 3
Switch(config-if)#
%LINK-5-CHANGED: Interface Vlan3, changed state to up
%LINEPROTO-5-UPDOWN: Line protocol on Interface Vlan3, changed state to up
Switch(config-if)#ip address 3.3.3.1 255.255.255.0
Switch(config-if)#exit
Switch(config)#int vlan 4
Switch(config-if)#
%LINK-5-CHANGED: Interface Vlan4, changed state to up
Switch(config-if)#ip address 4.4.4.1 255.255.255.0
Switch(config-if)#exit
Switch(config)#

Switch(config)#ip routing //включить межсетевое взаимодействие, что бы пользователи из разных VLAN видели друг друга

Switch(config)#exit //выйти из режима глобальной конфигурации
Switch#show run //показать конфигурацию
----------------------------------------
...
//Конфигурация физических интерфейсов
interface FastEthernet0/1
 switchport access vlan 2
 switchport mode access
!
interface FastEthernet0/2
 switchport access vlan 3
 switchport mode access
!
interface FastEthernet0/3
 switchport access vlan 3
 switchport mode access
!
...
//Конфигурация виртуальных интерфейсов
interface Vlan1
 no ip address
 shutdown
!
interface Vlan2
 ip address 2.2.2.1 255.255.255.0
!
interface Vlan3
 ip address 3.3.3.1 255.255.255.0
!
interface Vlan4
 ip address 4.4.4.1 255.255.255.0
 ...
 -----------------------------------------
```
Настройка конечных устройств 
![[Pasted image 20240302111902.png]]
по одному конечному устройству на VLAN
