![[Pasted image 20240302113749.png]]

В сети каждого коммутатора L2 есть два сегмента VLAN2, VLAN3
Настройка их стандартная

==Настройка конечных устройств с указанием шлюза==

Что бы пробросить VLAN2, VLAN3 из коммутатора L2 в L3 настраиваться интерфейс в режиме trunk, пример для одного коммутатора L2
```cisco
//в режиме глобального конфигурирования
Switch(config)#int gi1/1 //настройка инетрфейса gigabitEthernet1/1
Switch(config-if)#switchport mode trunk //переключить в режим trunk
Switch(config-if)#
%LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet1/1, changed state to down
%LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet1/1, changed state to up
Switch(config-if)#switchport trunk allowed vlan 2,3 //пробросить по нему vlan 2,3
Switch(config-if)#exit //выйти из настройки gigabitEthernet1/1
```

Надо настроить Коммутатор L3 для приема trunk, пример для одного из принимающих интерфейсов
```cisco
Switch(config)#int gi0/1 //выбор интерфейса GigabitEthernet0/1
Switch(config-if)#switchport mode trunk //переключение в режим trunk
Command rejected: An interface whose trunk encapsulation is "Auto" can not be configured to "trunk" mode.
Switch(config-if)#switchport trunk encapsulation dot1q //обязательно указать инкапсуляцию, не знаю зачем
Switch(config-if)#switchport trunk allowed vlan 2,3 //пробросить vlan 2,3
Switch(config-if)#exit //выйти из настройки
```

Так же на коммутаторе L3 нужно создать vlan
```cisco
Switch(config)#vlan 2
Switch(config-vlan)#
%LINK-5-CHANGED: Interface Vlan2, changed state to up
%LINEPROTO-5-UPDOWN: Line protocol on Interface Vlan2, changed state to up
Switch(config-vlan)#name VLAN2
Switch(config-vlan)#exit
Switch(config)#vlan 3
Switch(config-vlan)#
%LINK-5-CHANGED: Interface Vlan3, changed state to up
%LINEPROTO-5-UPDOWN: Line protocol on Interface Vlan3, changed state to up
Switch(config-vlan)#name VLAN3
Switch(config-vlan)#exit

//Установить IP адреса на сегментов
Switch(config)#int vlan 2
Switch(config-if)#ip address 2.2.2.1 255.255.255.0
Switch(config-if)#exit
Switch(config)#int vlan 3
Switch(config-if)#ip address 3.3.3.1 255.255.255.0
Switch(config-if)#exit

//включаем ip-routing
Switch(config)#ip routing
```