![[Pasted image 20240302173911.png]]

Для установления связи между роутерами нужно сконфигурировать интерфейсы по которым они подключены. VLAN не используется.

**На одной стороне**
```cisco
Router(config)#int gi0/1
Router(config-if)#no shutdown 
Router(config-if)#
%LINK-5-CHANGED: Interface GigabitEthernet0/1, changed state to up
Router(config-if)#ip address 192.168.70.1 255.255.255.252
```

**На другой стороне**
```cisco
Router(config)#int gi0/0
Router(config-if)#
%LINK-5-CHANGED: Interface GigabitEthernet0/0, changed state to up
%LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/0, changed state to up
Router(config-if)#ip address 192.168.70.2 255.255.255.252
```

Для того что бы компьютеры из сетей Router4 могли пинговать компьютеры в сетях Router5, можно прописать статические маршруты до этих сетей через Router5. Но так как у Router4 один выход в мир, то проще задать один дефолтный маршрут на Router5, которым он будет пользоваться если сеть ему не известна

**Router4**
```cisco
Router(config)#ip route 0.0.0.0 0.0.0.0 192.168.70.1 //дефолтный маршрут
Router(config)#exit
Router#
%SYS-5-CONFIG_I: Configured from console by console
Router#show ip route 
Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2, E - EGP
       i - IS-IS, L1 - IS-IS level-1, L2 - IS-IS level-2, ia - IS-IS inter area
       * - candidate default, U - per-user static route, o - ODR
       P - periodic downloaded static route

Gateway of last resort is 192.168.70.1 to network 0.0.0.0

     192.168.2.0/24 is variably subnetted, 2 subnets, 2 masks
C       192.168.2.0/24 is directly connected, GigabitEthernet0/1.2
L       192.168.2.1/32 is directly connected, GigabitEthernet0/1.2
     192.168.3.0/24 is variably subnetted, 2 subnets, 2 masks
C       192.168.3.0/24 is directly connected, GigabitEthernet0/1.3
L       192.168.3.1/32 is directly connected, GigabitEthernet0/1.3
     192.168.70.0/24 is variably subnetted, 2 subnets, 2 masks
C       192.168.70.0/30 is directly connected, GigabitEthernet0/0
L       192.168.70.2/32 is directly connected, GigabitEthernet0/0
S*   0.0.0.0/0 [1/0] via 192.168.70.1
```
Но что бы обратный пакет пинга возвращался, нужно что бы компьютеры в сети Router5 знали как добраться до Router4. Для этого выставим дефолтный маршрут на коммутаторе L3 на Router5 и пропишем статические маршруты до сетей Router4 на Router5

**Коммутатор L3**
```cisco
Switch(config)#ip route 0.0.0.0 0.0.0.0 192.168.55.1
```

**Router5**
```cisco
Router(config)#ip route 192.168.2.0 255.255.255.0 192.168.70.2
Router(config)#ip route 192.168.3.0 255.255.255.0 192.168.70.2
```
